배치와 스프링
배치가 필요한 이유
1. 모든 프로세스가 실시간 처리될 필요는 없다. 관련된 여러 프로세스가 다 처리될 때 까지 기다려야 되는 경우도 있다.
2. 비즈니스적인 이유. 주문과 동시에 출고가 되서 취소가 안된다면 고객과 판매자 모두 불편하다. 일괄 처리할 때 비용이 낮아지는 효과도 있음.
3. 데이터 모델링적인 이유. 첫번째 프로세스에서 데이터 양이 많고, 다음 프로세스에서 그 결과 데이터를 사용해서 빠른 처리가 필요할 때
배치 정의
유한한 양의 데이터를 상호작용이나 방해없이 처리하는 프로세스
배치 설계 시 고려사항
1. 사용성(usability),유지보수성(maintainability),확장성(extensibility)
2. 대용량성?(scalability)
3. 가용성(availability)
4. 보안(security)
자바 배치를 사용하는 이유
1. maintainability  - 웹과 다르게 배치는 트렌디하지 않고 스태틱함. 스프링과 자바의 궁합이 좋아 스프링 장점(테스트, 추상화)도 취할 수 있다.
2. Flexibility - 다른언어는 JVM이 없으니까 운영체제에 독립적이지 않다. “Write once, run anywhere”
3. Scalability
4. Development resources
5. Support - 자바 개발자들이 많으니까
6. Cost - 하드웨어, 소프트웨어 라이센스, 급여, 컨설팅 비용 등
